activagrogps/esp32-xbee/sdkconfig.defaults.esp32s3
1. Target the S3 Chip
CONFIG_IDF_TARGET="esp32s3"

# 2. Performance Settings
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# 3. Pin Definitions for ArduSimple Wiring
# Wiring: S3 Pin 17 -> RTK RX (DIN)
# Wiring: S3 Pin 18 -> RTK TX (DOUT)
CONFIG_XBEE_UART_TX_GPIO=17
CONFIG_XBEE_UART_RX_GPIO=18

# 4. Enable mDNS (Your requested feature)
CONFIG_MDNS_ENABLED=y
